## CI Results

| Check | Status |
|-------|--------|
| Terraform Validate | ⚠️  |
| Terraform Plan | ✅ ⚠️ Changes detected — review before merge. |
| Ansible Lint | ✅ success |
| Security Scan | ✅ success |

<details><summary>Full plan output</summary>

```hcl
HTJRXDBKBMWRUMAQWZQ6A][0m
[0m[1mmodule.alb_asg.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-alb/81b6d1324268e3d6/28b3c3e374f774eb][0m
[0m[1mmodule.alb_asg.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-alb/81b6d1324268e3d6/4046f37ea09b5023][0m
[0m[1mmodule.ghost_db.aws_cloudwatch_metric_alarm.database_connections: Refreshing state... [id=prod-ghost-db-connections][0m
[0m[1mmodule.ghost_db.aws_ssm_parameter.db_host: Refreshing state... [id=/prod/ghost/db/host][0m
[0m[1mmodule.ghost_db.aws_cloudwatch_metric_alarm.database_storage: Refreshing state... [id=prod-ghost-db-free-storage][0m
[0m[1mmodule.ghost_db.aws_cloudwatch_metric_alarm.database_cpu: Refreshing state... [id=prod-ghost-db-cpu-utilization][0m
[0m[1mmodule.ghost_db.aws_ssm_parameter.db_port: Refreshing state... [id=/prod/ghost/db/port][0m
[0m[1mmodule.ghost_db.aws_cloudwatch_metric_alarm.database_memory: Refreshing state... [id=prod-ghost-db-freeable-memory][0m
[0m[1mmodule.ghost_blog.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.ghost_blog.aws_iam_role.ecs_task_execution: Refreshing state... [id=prod-ghost-task-execution-role][0m
[0m[1mmodule.ghost_blog.aws_ecs_cluster.ghost: Refreshing state... [id=arn:aws:ecs:us-east-1:615299732970:cluster/prod-ghost-cluster][0m
[0m[1mmodule.ghost_blog.aws_security_group.ghost_alb: Refreshing state... [id=sg-0bef65f6b93722e42][0m
[0m[1mmodule.ghost_blog.aws_efs_file_system.ghost: Refreshing state... [id=fs-0200de2cf8c3e9fbd][0m
[0m[1mmodule.ghost_blog.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.ghost_blog.aws_iam_policy.ghost_task: Refreshing state... [id=arn:aws:iam::615299732970:policy/prod-ghost-task-policy][0m
[0m[1mmodule.ghost_blog.aws_iam_role.ecs_task: Refreshing state... [id=prod-ghost-task-role][0m
[0m[1mmodule.ghost_blog.aws_cloudwatch_log_group.ghost: Refreshing state... [id=/ecs/prod/ghost][0m
[0m[1mmodule.ghost_blog.aws_lb_target_group.ghost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:targetgroup/prod-ghost-tg/fcfdb975c519fe31][0m
[0m[1mmodule.ghost_blog.aws_security_group.ghost_tasks: Refreshing state... [id=sg-000b3376cf22a6f02][0m
[0m[1mmodule.ghost_blog.aws_lb.ghost: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:loadbalancer/app/prod-ghost-alb/8ef062d3062b68d7][0m
[0m[1mmodule.ghost_blog.aws_iam_role_policy_attachment.ghost_task: Refreshing state... [id=prod-ghost-task-role/arn:aws:iam::615299732970:policy/prod-ghost-task-policy][0m
[0m[1mmodule.ghost_blog.aws_security_group.ghost_efs: Refreshing state... [id=sg-08ecd3def54ffcf5c][0m
[0m[1mmodule.ghost_blog.aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=prod-ghost-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy][0m
[0m[1mmodule.ghost_blog.aws_iam_role_policy.ecs_task_execution_secrets: Refreshing state... [id=prod-ghost-task-execution-role:prod-ghost-execution-secrets][0m
[0m[1mmodule.ghost_blog.aws_efs_mount_target.ghost[1]: Refreshing state... [id=fsmt-05c6513455b666913][0m
[0m[1mmodule.ghost_blog.aws_efs_mount_target.ghost[0]: Refreshing state... [id=fsmt-0bf2fa7feb6844d2a][0m
[0m[1mmodule.ghost_blog.aws_efs_access_point.ghost: Refreshing state... [id=fsap-0cd32b36128350f73][0m
[0m[1mmodule.ghost_blog.aws_route53_record.ghost: Refreshing state... [id=Z04492601HFUDC7HTYJ6B__A][0m
[0m[1mmodule.ghost_blog.aws_route53_record.ghost_www: Refreshing state... [id=Z04492601HFUDC7HTYJ6B_www._A][0m
[0m[1mmodule.ghost_blog.aws_lb_listener.ghost_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-ghost-alb/8ef062d3062b68d7/e02f5bc7a01c6c1f][0m
[0m[1mmodule.ghost_blog.aws_lb_listener.ghost_https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-ghost-alb/8ef062d3062b68d7/78f54d2ffa99f566][0m
[0m[1mmodule.ghost_blog.aws_ecs_task_definition.ghost: Refreshing state... [id=prod-ghost][0m
[0m[1mmodule.ghost_blog.aws_ecs_service.ghost: Refreshing state... [id=arn:aws:ecs:us-east-1:615299732970:service/prod-ghost-cluster/prod-ghost-service][0m
[0m[1mmodule.observability[0].data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.monitoring.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.monitoring.aws_cloudwatch_log_group.nginx_error: Refreshing state... [id=/aws/ec2/prod/nginx/error][0m
[0m[1mmodule.monitoring.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.monitoring.aws_cloudwatch_log_group.nginx_access: Refreshing state... [id=/aws/ec2/prod/nginx/access][0m
[0m[1mmodule.observability[0].data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.alb_unhealthy_targets: Refreshing state... [id=prod-alb-unhealthy-targets][0m
[0m[1mmodule.observability[0].aws_iam_role.ecs_task_execution: Refreshing state... [id=prod-monitoring-task-execution-role][0m
[0m[1mmodule.observability[0].aws_efs_file_system.grafana: Refreshing state... [id=fs-01333ed1579d1b0cb][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.alb_target_response_time: Refreshing state... [id=prod-alb-response-time-high][0m
[0m[1mmodule.observability[0].aws_iam_policy.prometheus_ecs_discovery: Refreshing state... [id=arn:aws:iam::615299732970:policy/prod-prometheus-ecs-discovery][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.ghost_cpu_high: Refreshing state... [id=prod-ghost-cpu-high][0m
[0m[1mmodule.observability[0].aws_cloudwatch_log_group.prometheus: Refreshing state... [id=/ecs/prod/prometheus][0m
[0m[1mmodule.observability[0].aws_efs_file_system.prometheus: Refreshing state... [id=fs-04acdf2f1af810e32][0m
[0m[1mmodule.monitoring.aws_cloudwatch_dashboard.main[0]: Refreshing state... [id=prod-infrastructure-dashboard][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.ghost_memory_high[0]: Refreshing state... [id=prod-ghost-memory-high][0m
[0m[1mmodule.monitoring.aws_cloudwatch_metric_alarm.asg_cpu_high: Refreshing state... [id=prod-asg-cpu-high][0m
[0m[1mmodule.observability[0].aws_cloudwatch_log_group.grafana: Refreshing state... [id=/ecs/prod/grafana][0m
[0m[1mmodule.observability[0].aws_security_group.grafana_alb: Refreshing state... [id=sg-0db69e7cc4d9380f8][0m
[0m[1mmodule.observability[0].aws_lb_target_group.grafana: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:targetgroup/prod-grafana-tg/56058aaf7f63c614][0m
[0m[1mmodule.observability[0].aws_service_discovery_private_dns_namespace.monitoring: Refreshing state... [id=ns-36zgsqjndk6e5zki][0m
[0m[1mmodule.observability[0].aws_iam_role.prometheus_task: Refreshing state... [id=prod-prometheus-task-role][0m
[0m[1mmodule.observability[0].aws_ssm_parameter.prometheus_config: Refreshing state... [id=/prod/prometheus/config][0m
[0m[1mmodule.observability[0].aws_iam_role_policy_attachment.ecs_task_execution: Refreshing state... [id=prod-monitoring-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy][0m
[0m[1mmodule.observability[0].aws_efs_access_point.grafana: Refreshing state... [id=fsap-0e42d91e1fb419577][0m
[0m[1mmodule.observability[0].aws_efs_access_point.prometheus: Refreshing state... [id=fsap-0f2ca39855b0a6669][0m
[0m[1mmodule.observability[0].aws_lb.grafana: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:loadbalancer/app/prod-grafana-alb/d406e6c3ae808096][0m
[0m[1mmodule.observability[0].aws_security_group.monitoring_tasks: Refreshing state... [id=sg-0df570426ed4a868d][0m
[0m[1mmodule.observability[0].aws_ecs_task_definition.grafana: Refreshing state... [id=prod-grafana][0m
[0m[1mmodule.observability[0].aws_iam_role_policy_attachment.prometheus_ecs_discovery: Refreshing state... [id=prod-prometheus-task-role/arn:aws:iam::615299732970:policy/prod-prometheus-ecs-discovery][0m
[0m[1mmodule.observability[0].aws_ecs_task_definition.prometheus: Refreshing state... [id=prod-prometheus][0m
[0m[1mmodule.observability[0].aws_security_group.monitoring_efs: Refreshing state... [id=sg-06f9ac9094246939b][0m
[0m[1mmodule.observability[0].aws_service_discovery_service.prometheus: Refreshing state... [id=srv-ja4j4yaazvn7rhup][0m
[0m[1mmodule.observability[0].aws_efs_mount_target.prometheus[1]: Refreshing state... [id=fsmt-0e0a5fd42962504b1][0m
[0m[1mmodule.observability[0].aws_efs_mount_target.grafana[1]: Refreshing state... [id=fsmt-02edb3500a1db3bc5][0m
[0m[1mmodule.observability[0].aws_efs_mount_target.prometheus[0]: Refreshing state... [id=fsmt-0b89821d0559241fc][0m
[0m[1mmodule.observability[0].aws_efs_mount_target.grafana[0]: Refreshing state... [id=fsmt-0bdf051bf6402160a][0m
[0m[1mmodule.observability[0].aws_lb_listener.grafana_https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-grafana-alb/d406e6c3ae808096/9195855338922d9e][0m
[0m[1mmodule.observability[0].aws_lb_listener.grafana_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:615299732970:listener/app/prod-grafana-alb/d406e6c3ae808096/da8e41f1d44835fd][0m
[0m[1mmodule.observability[0].aws_ecs_service.grafana: Refreshing state... [id=arn:aws:ecs:us-east-1:615299732970:service/prod-ghost-cluster/prod-grafana-service][0m
[0m[1mmodule.observability[0].aws_ecs_service.prometheus: Refreshing state... [id=arn:aws:ecs:us-east-1:615299732970:service/prod-ghost-cluster/prod-prometheus-service][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.observability[0].aws_ecs_service.prometheus[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ecs_service" "prometheus" {
        id                                 = "arn:aws:ecs:us-east-1:615299732970:service/prod-ghost-cluster/prod-prometheus-service"
        name                               = "prod-prometheus-service"
        tags                               = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-prometheus-service"
        }
        [90m# (19 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m service_registries {
          [33m~[0m[0m registry_arn   = "arn:aws:servicediscovery:us-east-1:615299732970:service/srv-ja4j4yaazvn7rhup" -> (known after apply)
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.observability[0].aws_service_discovery_service.prometheus[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_service_discovery_service" "prometheus" {
      [33m~[0m[0m arn           = "arn:aws:servicediscovery:us-east-1:615299732970:service/srv-ja4j4yaazvn7rhup" -> (known after apply)
      [33m~[0m[0m id            = "srv-ja4j4yaazvn7rhup" -> (known after apply)
        name          = "prometheus"
      [33m~[0m[0m namespace_id  = "ns-36zgsqjndk6e5zki" -> (known after apply)
        tags          = {
            "Environment" = "prod"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-prometheus-discovery"
        }
      [33m~[0m[0m type          = "DNS_HTTP" -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m health_check_custom_config {} [31m# forces replacement[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.
[0m
```
</details>